{
  "aboutme": {
      "name": "Benjamin Karla",
      "job": "Developer & IT-Projektmanager",
      "profilimage": "http://benjamin-karla.de/assets/images/profile.png",
      "text": "Durch meine Ausbildung zum Fachinformatiker für Anwendungsentwicklung und dem dualen Studium wurde meine Leidenschaft zur Softwareentwicklung geweckt.\n\nSeit dem Abschluss meiner Ausbildung konnte ich bereits umfangreiche Erfahrungen in Softwareprojekten sammeln. Sowohl als IT-Consultant in einer leitenden Position, als auch in der Rolle als Entwickler verfüge ich über weitreichende Kenntnisse. Neben meinen beruflichen Projekten setze ich meinen Fokus auch auf eigene Ideen, um diese stets zu eigenen Projekten weiterzuentwickeln.\n\nIch bin auf der Suche nach interessanten Kontakten, spannenden neuen Technologien und Themen, sowie Projektpartner und neuen Herausforderungen.",
      "location": "Mainz, DE",
      "contactDetails": {
        "mail": "mail@benjamin-karla.de",
        "xing": "https://www.xing.com/profile/Benjamin_Karla/cv",
        "linkedin": "https://www.linkedin.com/in/benjamin-karla-a2737834/"
      }
    },
  "projects": [
    {"title": "Webseite", "subtitle": "Startup Internetauftritt", "image": "http://benjamin-karla.de/assets/images/projects/project-evofintech.png", "text": "Zuletzt habe ich ein junges Startup Unternehmen bei der Erstellung ihrer Webseite unterstützt. Das Projekt wurde mit HTML5, JavaScript und JQuery umgesetzt."},
    {"title": "Digitale Inventarisierung aller Art von Gegenständen", "subtitle": "", "image": "http://benjamin-karla.de/assets/images/projects/project-inventory.jpg", "text": "Inventory unterstützt Sie bei jeglicher Art der Inventarisierung. Von der privaten DVD Sammlung, bis hin zur professionellen Geschäftsinventur."},
    {"title": "Binäre Risiko Analyse", "subtitle": "", "image": "http://benjamin-karla.de/assets/images/projects/project-bra.jpg", "text": "Dieses Projekt ist im Rahmen meiner Bachelorthesis entstanden und basiert auf den Grundlagen von Ben Sapiro. Bei der Binary Risk Analysis (BRA) handelt es sich grundlegend um eine einfache, schnelle und effektive Methode zur IT-Risikoeinschätzung. Meine Arbeit erweitert das Grundkonzept um weitere Fragenkataloge zu neuen Bedrohungsszenarien. Derzeit befindet sich die App in der entwicklung."}
  ],
  "experiences": [
    {"title":  "Softwarearchitekt", "company": "DG Verlag", "period":  "2019 - Heute", "description": "[BEARBEITEN!] Als Softwareachitekt begleite ich die Einführung neuer Softwaresystem sowohl im Green- als auch Brownfield. Bestandteile meiner Tätigkeiten sind vorallem die Analyse der bestehenden Systemlandschaft, als auch die Anforderungsanalyse an die neuen Systeme. Meine Erfahrung als Softwareentwickler ermöglichen es mir neue Systeme schneller zu analysieren und kleinere Anpassungen auch mal selbst durchzuführen. Derzeit umfassen meine Tätigkeiten beim DG Verlag, neben den Aufgaben eines Softwarearchitekten, auch die eines Softwareentwicklers und Projektmanagers."},
    {"title":  "Customer Success Manager", "company": "Bright Solutions GmbH", "period":  "2018 - 2019", "description": "[BEARBEITEN!] Derzeit arbeite ich als Projektmanager in einem mittelständischen Unternehmen und betreue dort parallel mehrere IT Projekte, welche mit dem CMS Drupal umgesetzt werden. Hierbei gehören Kommunikation, das Erstellen von Konzepten, sowie das Koordinieren von Projekten und dem Team zu meinen Kerntätigkeiten. Zu den genannten Kerntätigkeiten kommen selbstverständlich noch weitere Projekttypische Aufgaben wie das Monitoren des Projektfortschritts, Controlling und die Präsentation der Ergebnisse zu meinen täglichen Aufgaben hinzu. Das Vorgehen in meinen Projekten ist hierbei stets durch die agile Vorgehensweise geprägt."},
    {"title":  "IT-Consultant", "company": "BPVR Unternehmensberatung GmbH", "period":  "2016 - 2018", "description": "In meiner Arbeit als IT-Consultant für ein marktführendes Telekommunikationsunternehmen erhalte ich Einblick in neue spannende und wegweisende Projekte. Von der Erstellung eines Produktmodells mit SAP SME und SAP CPQ bis hin zur Strukturierung der Infrastruktur gehören die unterschiedlichsten Aufgaben zu meinen Tätigkeiten."},
    {"title":  "Software Developer & Junior IT-Projektmanager", "company": "HPM Kommunikation GmbH", "period":  "2014 - 2016", "description": "In meiner Zeit nach der Ausbildung war es mir möglich die Brücke zwischen der Softwareentwicklung und dem Projektmanagement zu schlagen. Zu meinen Tätigkeiten als Junior IT-Projektmanager zählten folgende Aufgaben:\n\n- Projektmanagement mit dem Schwerpunkt IT\n\n- Kundenbetreeung\n\n- Projektberatung von App-, Website, Microsoft-Projekten und Web-Anwendungen\n\n- Hardwaresupport vor Ort beim Kunden\n\nFolgende Tätigkeiten habe ich in der Rolle als Softwareentwickler ausgeübt:\n\n- Mobile Application Developer iOS und Android\n\n- Crossplattform Entwicklung mit JavaScript\n\n- Programmierung in den Sprachen HTML, CSS, SQL und JavaScript"},
    {"title":  "Ausbildung Fachinformatiker für Anwendungsentwicklung", "company": "HPM Kommunikation GmbH", "period":  "2011 - 2014", "description": "In meiner Ausbildung konnte ich meine Fähigkeit als Softwareentwickler stark ausprägen. Diese Fähigkeiten basieren auf der praktischen Erfahrung im Unternehmen im Zusammenspiel mit den theoretischen Inahlten des Studiums. Im Rahmen der Praxis habe ich regelmäßig mit den Programmiersprachen HTML, CSS, SQL und JavaScript gearbeitet. Dabei fokusierte sich meine Arbeit als Programmierer auf die Entwicklung von Crossplattform Apps."}
  ],
  "skills": [
    {
      "title": "Developer Skills",
      "introText": "JavaScript: App Entwicklung iOS & Android \n HTML5 & CCS3: Website Gestaltung \n SQL: App- und Website-Backend \nSAP SME: Entwicklung von Produktmodellen",
      "skills": [
        {"name": "JavaScript & Angular", "value": "80", "text": "Sehr gut"},
        {"name": "HTML5 & CSS", "value": "70", "text": "Gut"},
        {"name": "SQL", "value": "70", "text": "Gut"},
        {"name": "SAP SME", "value": "55", "text": "Gut"}
      ]
    },
    {
      "title": "PM Skills",
      "introText": "Management: Qualitäts-, Prozess & Anforderungsmanagement \nProjektmanagement klassisch: Wasserfall \nProjektmanagement modern: Agile Vorgehensweise (SCRUM) \nKommunikation: Kommunikation im Team und mit dem Kundenbetreeung \nBelastbarkeit \nOrganisationsfähigkeit und Strukturierung",
      "skills": [
        {"name": "Management", "value": "80", "text": "Gut"},
        {"name": "Projektmanagement klassisch", "value": "60", "text": "Gut"},
        {"name": "Projektmanagement agil", "value": "80", "text": "Sehr gut"},
        {"name": "Kommunikation", "value": "75", "text": "Gut"},
        {"name": "Belastbarkeit", "value": "75", "text": "Gut"},
        {"name": "Organisationsfähigkeit", "value": "80", "text": "Sehr gut"}
      ]
    }
  ],
  "education": [
    {
      "title": "BSc Medien, IT & Management",
      "location": "Hochschule Mainz",
      "period": "2011-2015"
    },
    {
      "title": "Ausbildung zum Fachinformatiker für Anwendungsentwicklung",
      "location": "HPM Kommunikation GmbH",
      "period": "2011-2014"
    }
  ],
  "qualification": [
    {
      "title": "SAP",
      "description": "SAP CPQ Modeling Intensive Training",
      "year": "2017"
    },
    {
      "title": "IT-Security",
      "description": "TÜV zertifizierter IT-Sicherheitsbeauftragter",
      "year": "2014"
    }
  ],
  "language": [
    {
      "language": "Deutsch",
      "levelText": "Muttersprache",
      "level": 5
    },
    {
      "language": "Englisch",
      "levelText": "Gut",
      "level": 3.5
    }
  ]
}
